'''
2. Дан список:
['в', '5', 'часов', '17', 'минут', 'температура', 'воздуха', 'была', '+5', 'градусов']
Необходимо его обработать — обособить каждое целое число (вещественные не трогаем) кавычками
(добавить кавычку до и кавычку после элемента списка, являющегося числом) и дополнить нулём до двух целочисленных разрядов:
['в', '"', '05', '"', 'часов', '"', '17', '"', 'минут', 'температура', 'воздуха', 'была', '"', '+05', '"', 'градусов']
Сформировать из обработанного списка строку:
в "05" часов "17" минут температура воздуха была "+05" градусов
Подумать, какое условие записать, чтобы выявить числа среди элементов списка?
Как модифицировать это условие для чисел со знаком?
Примечание: если обособление чисел кавычками не будет получаться - можете вернуться к его реализации позже.
Главное: дополнить числа до двух разрядов нулём!

3. * (вместо задачи 2) Решить задачу 2 не создавая новый список (как говорят, in place). Эта задача намного серьёзнее, чем может сначала показаться.
'''

weather_list = ['в', '5', 'часов', '17', 'минут', 'температура', 'воздуха', 'была', '+5', 'градусов']

i = 0
while i < len(weather_list):
    element = weather_list[i]
    if element[0] in ['-', '+']:
        weather_list[i] = f"{element[0]}{int(element[1:]):02d}"
        weather_list.insert(i + 1, '"')
        weather_list.insert(i, '"')
        i += 1
    else:
        if element.isdigit():
            weather_list[i] = f"{int(element):02d}"
            weather_list.insert(i + 1, '"')
            weather_list.insert(i, '"')
            i += 1
    i += 1
print(weather_list)

final_str = ''
for element in weather_list:
    if element[0] == '-' or element[0] == '+':
        final_str += f'"{element[0]}{int(element[1:]):02d}"'
    else:
        if element.isdigit():
            final_str += f'"{int(element):02d}"'
        elif element != '"':
            final_str += f' {element} '
print(final_str)

